# VS Code (and forks/variants) extensions.
#
# Kept separate from the profile Brewfiles and installed on its own via
# `./install vscode` (see install.vscode.conf.yaml), because `code
# --install-extension` races VS Code's extensions.json under brew bundle's
# parallel installer — scripts/brew_bundle.zsh runs this file in two passes to
# absorb that. Requires the `code` CLI (VS Code is installed by essentials).
#
# Re-dump with: brew bundle dump --vscode --force \
#   --file=~/dev/pattobrien/dotfiles/brew/vscode/Brewfile
vscode "aaron-bond.better-comments"
vscode "actboy168.lua-debug"
vscode "albert.tabout"
vscode "alexkrechik.cucumberautocomplete"
vscode "alexpasmantier.television"
vscode "amodio.tsl-problem-matcher"
vscode "andys8.jest-snippets"
vscode "antfu.slidev"
vscode "anthropic.claude-code"
vscode "appulate.filewatcher"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "austenc.tailwind-docs"
vscode "batisteo.vscode-django"
vscode "be5invis.vscode-custom-css"
vscode "berublan.vscode-log-viewer"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "blaugold.melos-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "connor4312.esbuild-problem-matchers"
vscode "cs50.vscode-presentation-mode"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "databricks.neon-local-connect"
vscode "dbaeumer.vscode-eslint"
vscode "dberezin.lox-language"
vscode "denoland.vscode-deno"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "edonet.vscode-command-runner"
vscode "emilast.logfilehighlighter"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "exceedsystem.vscode-macros"
vscode "flutterando.flutter-coverage"
vscode "gabrielgrinberg.auto-run-command"
vscode "giancarlocode.built-value-snippets"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gluestack.gluestack-vscode"
vscode "golang.go"
vscode "google.arb-editor"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "gruntfuggly.triggertaskonsave"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnstew.gif"
vscode "jspolancor.presentationmode"
vscode "kaiqun.build-runner"
vscode "kakumei.ts-debug"
vscode "kevinrose.vsc-python-indent"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "localizely.flutter-intl"
vscode "luanpotter.dart-import"
vscode "lukepighetti.build-runner"
vscode "lunuan.kubernetes-templates"
vscode "mathematic.vscode-pdf"
vscode "mattpocock.ts-error-translator"
vscode "mike-lischke.vscode-antlr4"
vscode "miquelddg.dart-barrel-file-generator"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "mushan.vscode-paste-image"
vscode "mutantdino.resourcemonitor"
vscode "nash.awesome-flutter-snippets"
vscode "nicollasr.vscode-streamdeck"
vscode "njpwerner.autodocstring"
vscode "orestesgaolin.dart-export-index"
vscode "oven.bun-vscode"
vscode "patbenatar.advanced-new-file"
vscode "paulshen.paul-typescript-toolkit"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "philstainer.git-worktree"
vscode "plibither8.remove-comments"
vscode "poml-team.poml"
vscode "prisma.prisma"
vscode "qcz.text-power-tools"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "rodydavis.signals-dart"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "saber2pr.ts-ast-viewer"
vscode "sanjulaganepola.github-local-actions"
vscode "sergelamikhov.lcov-lang"
vscode "shopify.ruby-lsp"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "supabase.postgrestools"
vscode "supernovaio.pulsar-vsc-extension"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tumido.crd-snippets"
vscode "twxs.cmake"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vercel.turbo-vsc"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-ext.sync-rsync"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "wscats.cors-browser"
vscode "xaver.clang-format"
vscode "xdebug.php-pack"
vscode "yzane.markdown-pdf"
vscode "zardoy.ts-essential-plugins"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zhuangtongfa.material-theme"
