tap "dsully/tap"

# Shell
brew "zsh"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Essential CLI tools
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "tree"
brew "tmux"
brew "raine/workmux/workmux"
# Touch ID for sudo inside tmux (see scripts/setup_touchid_sudo.zsh)
brew "pam-reattach"
brew "wget"
brew "curl"

brew "gh"
brew "dsully/tap/macos-defaults"
brew "mise"

# 1Password
cask "1password"
cask "1password-cli"

# Editor (pick one or both)
cask "cursor"
# cask "visual-studio-code"
cask "kitty"
cask "ghostty"


cask "google-chrome"
cask "raycast"

# Keyboard customizer (reads ~/.config/karabiner, symlinked by the base install)
cask "karabiner-elements"

# Hammerspoon + Hammerflow leader-key bindings (reads ~/.hammerspoon, symlinked
# by the base install; Karabiner maps Right Cmd -> F18 as the leader)
cask "hammerspoon"