tap "anomalyco/tap"
tap "desdaemon/repo"
tap "felangel/mason"
tap "hashicorp/tap"
tap "jetbrains/utils"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "modularml/packages"
tap "scarvalhojr/tap"
tap "schpet/tap"
tap "shopify/shopify"
tap "smithy-lang/tap"
tap "sst/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"
# Run your GitHub Actions locally
brew "act"
# ANother Tool for Language Recognition
brew "antlr"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Code searching, linting, rewriting
brew "ast-grep"
# Automatic configure script builder
brew "autoconf"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Emacs dependency management
brew "cask"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line tool for DigitalOcean
brew "doctl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Installer for the general purpose language Haskell
brew "ghcup"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# jq - migrated to asdf
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# kubernetes-cli - migrated to asdf
# Command-line interface for deploying apps to the LangGraph platform
brew "langgraph-cli"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Pager program similar to more
brew "less"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Neon CLI tool
brew "neonctl"
# Development kit for the Java programming language
brew "openjdk@11"
# OpenShift command-line interface tools
brew "openshift-cli"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# postgresql - migrated to asdf
# Theme for zsh
brew "powerlevel10k"
# protobuf - migrated to asdf (protoc)
# Develop and deploy code with zero configuration
brew "railway"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# High-performance system programming language
brew "swift"
# User interface to the TELNET protocol
brew "telnet"
# tflint - migrated to asdf
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# typst - migrated to asdf
# Vi 'workalike' with many additional features
brew "vim"
# Universal WebAssembly Runtime
brew "wasmer"
# Execute commands when watched files change
brew "watchexec"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Official Language Server Protocol for the Kotlin language
brew "jetbrains/utils/kotlin-lsp"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Advent of Code command-line helper tool
brew "scarvalhojr/tap/aoc-cli"
# CLI tool for linear.app that uses git branch names and directory names to open issues and team pages
brew "schpet/tap/linear"
# Smithy CLI - A CLI for building, validating, querying, and iterating on Smithy models
brew "smithy-lang/tap/smithy-cli"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Supabase CLI
brew "supabase/tap/supabase"

# ===================
# TIER 1 - Essential (install first)
# ===================
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Web browser
cask "google-chrome"
# GPU-based terminal emulator
cask "kitty"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# App to build and share containerised applications and microservices
cask "docker-desktop"

# ===================
# TIER 2 - Development Tools
# ===================
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Toolset to implement parts of Android apps in native code
cask "android-ndk"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# HTTP and GraphQL Client
cask "insomnia"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
cask "font-hack-nerd-font"

# ===================
# TIER 3 - Productivity
# ===================
# Disk space visualiser
cask "daisydisk"
# Voice and text chat software
cask "discord"
# Status monitoring
cask "eul"
# App to manage software development and track bugs
cask "linear-linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Screen and video recording software
cask "loom"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Video communication and virtual meeting platform
cask "zoom"
